## Plan Result (prod-enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 69 to add, 0 to change, 69 to destroy.</code></pre>

* Replace
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform System Integration Testing&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["CRIME-ADO-POC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240/providers/Microsoft.Authorization/roleAssignments/e59ecbd1-c311-d097-e73e-3b45844fc5a4" -> (known after apply)
      ~ name                             = "e59ecbd1-c311-d097-e73e-3b45844fc5a4" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68/providers/Microsoft.Authorization/roleAssignments/b8167e8b-60b8-23d3-53a3-0dca11feed67" -> (known after apply)
      ~ name                             = "b8167e8b-60b8-23d3-53a3-0dca11feed67" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/ddd45636-d58a-437f-8ad8-99b0add0092b/providers/Microsoft.Authorization/roleAssignments/a4a5f5c6-e890-a719-d865-881777060a6f" -> (known after apply)
      ~ name                             = "a4a5f5c6-e890-a719-d865-881777060a6f" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ddd45636-d58a-437f-8ad8-99b0add0092b/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFT-Sandbox"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleAssignments/c22793d3-2d6d-597b-bb40-862130794ee5" -> (known after apply)
      ~ name                             = "c22793d3-2d6d-597b-bb40-862130794ee5" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFT-VH-Pilot"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/4bb049c8-33f3-4860-91b4-9ee45375cc18/providers/Microsoft.Authorization/roleAssignments/b3918351-286c-a7f4-71cb-459928ceed46" -> (known after apply)
      ~ name                             = "b3918351-286c-a7f4-71cb-459928ceed46" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/4bb049c8-33f3-4860-91b4-9ee45375cc18/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-DEMO"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleAssignments/490574b8-70c9-554c-fb1a-f21805aed5ca" -> (known after apply)
      ~ name                             = "490574b8-70c9-554c-fb1a-f21805aed5ca" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-DEV"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/providers/Microsoft.Authorization/roleAssignments/ab37b7e9-37fc-fd3b-620b-e4b521a89c88" -> (known after apply)
      ~ name                             = "ab37b7e9-37fc-fd3b-620b-e4b521a89c88" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-ITHC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/providers/Microsoft.Authorization/roleAssignments/36641219-0fec-83c1-9740-6b60d73b217a" -> (known after apply)
      ~ name                             = "36641219-0fec-83c1-9740-6b60d73b217a" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/providers/Microsoft.Authorization/roleAssignments/3ca58132-298d-3bf1-53c9-b34b0dafa3bc" -> (known after apply)
      ~ name                             = "3ca58132-298d-3bf1-53c9-b34b0dafa3bc" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleAssignments/9bd8ee4c-8ceb-7e9b-8551-94956f12d21c" -> (known after apply)
      ~ name                             = "9bd8ee4c-8ceb-7e9b-8551-94956f12d21c" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-STG"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/providers/Microsoft.Authorization/roleAssignments/82a4495c-09c1-a72f-f02b-32a95e12d969" -> (known after apply)
      ~ name                             = "82a4495c-09c1-a72f-f02b-32a95e12d969" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-TEST"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/providers/Microsoft.Authorization/roleAssignments/f249d355-cc5c-f23e-9d2f-addfdd6b065d" -> (known after apply)
      ~ name                             = "f249d355-cc5c-f23e-9d2f-addfdd6b065d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPSDATA-DEMO"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/dbd3a97b-580e-4ecb-9ed3-4e86f6f23d25/providers/Microsoft.Authorization/roleAssignments/ec638806-a572-d0ea-066e-5bae74109566" -> (known after apply)
      ~ name                             = "ec638806-a572-d0ea-066e-5bae74109566" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/dbd3a97b-580e-4ecb-9ed3-4e86f6f23d25/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleAssignments/b3d70192-a392-109d-1dae-a89958265d60" -> (known after apply)
      ~ name                             = "b3d70192-a392-109d-1dae-a89958265d60" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CNP-Prod"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleAssignments/28ef13b2-8766-22d0-cc75-21b8180f1427" -> (known after apply)
      ~ name                             = "28ef13b2-8766-22d0-cc75-21b8180f1427" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CNP-QA"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/providers/Microsoft.Authorization/roleAssignments/8ad17028-253c-9079-9c8c-9d421cbeb0e6" -> (known after apply)
      ~ name                             = "8ad17028-253c-9079-9c8c-9d421cbeb0e6" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-MI-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee/providers/Microsoft.Authorization/roleAssignments/aa58f28e-dd1b-34c9-7eff-505da6b5f67c" -> (known after apply)
      ~ name                             = "aa58f28e-dd1b-34c9-7eff-505da6b5f67c" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-RDO-Development"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/fa397675-6ddf-4cb0-b1fc-bc7df0e51bf4/providers/Microsoft.Authorization/roleAssignments/da6facc7-6053-3891-7377-1df7c49444ba" -> (known after apply)
      ~ name                             = "da6facc7-6053-3891-7377-1df7c49444ba" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id         

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2/providers/Microsoft.Authorization/roleAssignments/53895f85-42b2-ffa9-866d-1ab3c14d802e" -> (known after apply)
      ~ name                             = "53895f85-42b2-ffa9-866d-1ab3c14d802e" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MOJ DCD Atlassian LVE"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/providers/Microsoft.Authorization/roleAssignments/eb721a35-32ac-6955-6c44-d6603de4483a" -> (known after apply)
      ~ name                             = "eb721a35-32ac-6955-6c44-d6603de4483a" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MOJ DCD Atlassian NLE"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/providers/Microsoft.Authorization/roleAssignments/91f85cc2-b37a-4132-d36e-7621565674eb" -> (known after apply)
      ~ name                             = "91f85cc2-b37a-4132-d36e-7621565674eb" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Non-Functional Testing"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/274541e0-1d81-4466-82af-15cd40e86c96/providers/Microsoft.Authorization/roleAssignments/94462c51-2dd8-5513-c867-dc2758c51e79" -> (known after apply)
      ~ name                             = "94462c51-2dd8-5513-c867-dc2758c51e79" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/274541e0-1d81-4466-82af-15cd40e86c96/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Non-Live Management"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/66cfcc0b-d764-4c07-bbeb-0a74101dbcf3/providers/Microsoft.Authorization/roleAssignments/2e8e05c7-d55c-c3be-191f-7b33e5647cf3" -> (known after apply)
      ~ name                             = "2e8e05c7-d55c-c3be-191f-7b33e5647cf3" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/66cfcc0b-d764-4c07-bbeb-0a74101dbcf3/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Online Plea Pre-Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/e854024f-5d34-4043-a7a7-cbf4bb6f4d67/providers/Microsoft.Authorization/roleAssignments/2a1b7326-4f14-4e4c-f94b-abac6899888e" -> (known after apply)
      ~ name                             = "2a1b7326-4f14-4e4c-f94b-abac6899888e" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/e854024f-5d34-4043-a7a7-cbf4bb6f4d67/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Online Plea Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/5ff94e9e-4276-4e4b-b36b-475101d613d4/providers/Microsoft.Authorization/roleAssignments/665f7590-0498-a63b-eb22-4dba7a8aec3a" -> (known after apply)
      ~ name                             = "665f7590-0498-a63b-eb22-4dba7a8aec3a" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/5ff94e9e-4276-4e4b-b36b-475101d613d4/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Operational Services"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/28d33a47-7c14-456d-9a40-ce9c9b5a3937/providers/Microsoft.Authorization/roleAssignments/1dd43211-16df-b340-83be-457afce62156" -> (known after apply)
      ~ name                             = "1dd43211-16df-b340-83be-457afce62156" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/28d33a47-7c14-456d-9a40-ce9c9b5a3937/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Pilot"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/4c335e3a-f3d5-41cb-91d5-f2816853a22a/providers/Microsoft.Authorization/roleAssignments/bddffe3f-912b-96ab-b919-d3265ecb80cb" -> (known after apply)
      ~ name                             = "bddffe3f-912b-96ab-b919-d3265ecb80cb" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/4c335e3a-f3d5-41cb-91d5-f2816853a22a/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Pre-Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/3d84f717-22a0-4f4e-aac7-5ff8f4ee0a90/providers/Microsoft.Authorization/roleAssignments/da6e2560-fe65-939f-207f-050a055efc63" -> (known after apply)
      ~ name                             = "da6e2560-fe65-939f-207f-050a055efc63" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/3d84f717-22a0-4f4e-aac7-5ff8f4ee0a90/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/55c2f45e-1381-4b17-9bd0-f85215b8bb4f/providers/Microsoft.Authorization/roleAssignments/77704059-840c-2a15-fef5-7b6d0a87abcf" -> (known after apply)
      ~ name                             = "77704059-840c-2a15-fef5-7b6d0a87abcf" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/55c2f45e-1381-4b17-9bd0-f85215b8bb4f/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Security Operations"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/c7d20737-15ae-45da-bec4-67da9c029ddc/providers/Microsoft.Authorization/roleAssignments/63838668-1cf7-1216-fa70-7bb0950c26de" -> (known after apply)
      ~ name                             = "63838668-1cf7-1216-fa70-7bb0950c26de" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/c7d20737-15ae-45da-bec4-67da9c029ddc/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform System Integration Testing"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/12ffc6f5-7035-41fc-b96a-846d8fedc94b/providers/Microsoft.Authorization/roleAssignments/9051708b-e635-691e-face-02f60f1a4d5f" -> (known after apply)
      ~ name                             = "9051708b-e635-691e-face-02f60f1a4d5f" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/12ffc6f5-7035-41fc-b96a-846d8fedc94b/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Operational Services Validation"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/6491a35d-b1cc-4823-8340-0b847abc9a1b/providers/Microsoft.Authorization/roleAssignments/64d36bb6-f002-c1e5-9eca-f3fff64d89cc" -> (known after apply)
      ~ name                             = "64d36bb6-f002-c1e5-9eca-f3fff64d89cc" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/6491a35d-b1cc-4823-8340-0b847abc9a1b/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce/providers/Microsoft.Authorization/roleAssignments/4d6951a5-5958-f91a-9940-53d472c68ac4" -> (known after apply)
      ~ name                             = "4d6951a5-5958-f91a-9940-53d472c68ac4" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleAssignments/a95bcb72-96cf-6d4f-7260-8e56dd2f1470" -> (known after apply)
      ~ name                             = "a95bcb72-96cf-6d4f-7260-8e56dd2f1470" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/providers/Microsoft.Authorization/roleAssignments/004d701d-2cf4-321a-c3b9-998c75efc39f" -> (known after apply)
      ~ name                             = "004d701d-2cf4-321a-c3b9-998c75efc39f" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 69 to add, 0 to change, 69 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":78,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->